# Groupby (Split-Apply-Combine)

In [1]:
import pandas as pd

In [2]:
dict={'City':['Ahmedabad','Baroda','Anand','Ahmedabad','Baroda','Anand'],
     'Temp':[40,35,32,45,37,34]}
data = pd.DataFrame(dict)
data

        City  Temp
0  Ahmedabad    40
1     Baroda    35
2      Anand    32
3  Ahmedabad    45
4     Baroda    37
5      Anand    34

# Split
- spliting the data into group

In [4]:
# boolean array generated for City columns of dataframe
grp_a=data['City']=='Ahmedabad'
grp_a

0     True
1    False
2    False
3     True
4    False
5    False
Name: City, dtype: bool

In [5]:
# pass it to data frame
grp_a=data[data['City']=='Ahmedabad']
grp_a

        City  Temp
0  Ahmedabad    40
3  Ahmedabad    45

In [8]:
grp_b=data[data['City']=='Baroda']
grp_b

     City  Temp
1  Baroda    35
4  Baroda    37

In [9]:
grp_c=data[data['City']=='Anand']
grp_c

    City  Temp
2  Anand    32
5  Anand    34

# Apply

In [11]:
grp_a=data[data['City']=='Ahmedabad']
avg_a=grp_a['Temp'].mean()
avg_a

42.5

In [12]:
grp_b=data[data['City']=='Baroda']
avg_b=grp_b['Temp'].mean()
avg_b

36.0

In [13]:
grp_c=data[data['City']=='Anand']
avg_c=grp_c['Temp'].mean()
avg_c

33.0

# Combine

In [14]:
dataf=pd.DataFrame({'City':['Ahmedabad','Baroda','Anand'],
                   'Temp':[avg_a,avg_b,avg_c]})

In [15]:
dataf

        City  Temp
0  Ahmedabad  42.5
1     Baroda  36.0
2      Anand  33.0

# working with one step by using groupby function

In [16]:
data

        City  Temp
0  Ahmedabad    40
1     Baroda    35
2      Anand    32
3  Ahmedabad    45
4     Baroda    37
5      Anand    34

In [20]:
grp=data.groupby('City')['Temp'].mean()

In [21]:
grp

City
Ahmedabad    42.5
Anand        33.0
Baroda       36.0
Name: Temp, dtype: float64